Notes/SOAP/4.Building-a-SOAP-Message.md

# Building a SOAP Message

To build a SOAP message you must first understand what a SOAP message is:

"A SOAP message is an ordinary XML document containing the following elements:

    An Envelope element that identifies the XML document as a SOAP message
    A Header element that contains header information
    A Body element that contains call and response information
    A Fault element containing errors and status information

All the elements above are declared in the default namespace for the SOAP envelope:

http://www.w3.org/2003/05/soap-envelope/

and the default namespace for SOAP encoding and data types is:

http://www.w3.org/2003/05/soap-encoding"







TODO: Make this page

Example request to a service I made:
```
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCountryRequest>
            <gs:name>United Kingdom</gs:name>
        </gs:getCountryRequest>
    </soapenv:Body>
</soapenv:Envelope>
```





The WSDL file is commonly used....

## Syntax Rules

Here are some important syntax rules:

    A SOAP message MUST be encoded using XML
    A SOAP message MUST use the SOAP Envelope namespace
    A SOAP message must NOT contain a DTD reference
    A SOAP message must NOT contain XML Processing Instructions

